package lesson2;

public class zadanie2 {
    public static void main(String[] args) {
        // Вывести на консоль цифры от 30 до 50, в обратном порядке
       for (int i = 50; i >= 30; i--) {
           System.out.println(i);
       }
    }
}
